<template>
  <div
    ref="box"
    class="box"
  >
    <ve-line
      :judge-width="true"
      :height="wapperHeight"
      class="box__chart"
      :data="chartData"
    />
  </div>
</template>

<script>
export default {
  data () {
    return {
      wapperHeight: '700px',
      chartData: {
        columns: ['日期', '访问用户', '下单用户'],
        rows: [
          { '日期': '2019-01-01', '访问用户': 1393, '下单用户': 1093 },
          { '日期': '2019-01-02', '访问用户': 3530, '下单用户': 3230 },
          { '日期': '2019-01-03', '访问用户': 2923, '下单用户': 2623 },
          { '日期': '2019-01-04', '访问用户': 1723, '下单用户': 1423 },
          { '日期': '2019-01-05', '访问用户': 3792, '下单用户': 3492 },
          { '日期': '2019-01-06', '访问用户': 4593, '下单用户': 3200 },
          { '日期': '2019-01-07', '访问用户': 3323, '下单用户': 1311 },
          { '日期': '2019-01-08', '访问用户': 3467, '下单用户': 1232 },
          { '日期': '2019-01-09', '访问用户': 1999, '下单用户': 1982 },
          { '日期': '2019-01-10', '访问用户': 4230, '下单用户': 2293 }
        ]
      }
    }
  }
}
</script>

<style scoped lang="less">
  .box{
    margin: 30px auto;
    height: 60vh;
    &__chart{
      height: 100%;
    }
  }
</style>
